In [8]:
import pandas as pd

In [13]:
df = pd.read_csv("uber_data.csv")

In [14]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,pickup_longitude,pickup_latitude,RatecodeID,store_and_fwd_flag,dropoff_longitude,dropoff_latitude,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,2016-03-01 00:00:00,2016-03-01 00:07:55,1,2.50,-73.976746,40.765152,1,N,-74.004265,40.746128,1,9.0,0.5,0.5,2.05,0.00,0.3,12.35
1,1,2016-03-01 00:00:00,2016-03-01 00:11:06,1,2.90,-73.983482,40.767925,1,N,-74.005943,40.733166,1,11.0,0.5,0.5,3.05,0.00,0.3,15.35
2,2,2016-03-01 00:00:00,2016-03-01 00:31:06,2,19.98,-73.782021,40.644810,1,N,-73.974541,40.675770,1,54.5,0.5,0.5,8.00,0.00,0.3,63.80
3,2,2016-03-01 00:00:00,2016-03-01 00:00:00,3,10.78,-73.863419,40.769814,1,N,-73.969650,40.757767,1,31.5,0.0,0.5,3.78,5.54,0.3,41.62
4,2,2016-03-01 00:00:00,2016-03-01 00:00:00,5,30.43,-73.971741,40.792183,3,N,-74.177170,40.695053,1,98.0,0.0,0.0,0.00,15.50,0.3,113.80

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   tpep_pickup_datetime   100000 non-null  object
 2   tpep_dropoff_datetime  100000 non-null  object
 3   passenger_count        100000 non-null  int64
 4   trip_distance          100000 non-null  float64
 5   pickup_longitude       100000 non-null  float64
 6   pickup_latitude        100000 non-null  float64
 7   RatecodeID             100000 non-null  int64
 8   store_and_fwd_flag     100000 non-null  object
 9   dropoff_longitude      100000 non-null  float64
 10  dropoff_latitude       100000 non-null  float64
 11  payment_type           100000 non-null  int64
 12  fare_amount            100000 non-null  float64
 13  extra                  100000 non-null  float64
 14  mta_tax                100000 non-null  float64
 15  tip_amount             100000 non-null  float64
 16  tolls_amount           100000 non-null  float64
 17  improvement_surcharge  100000 non-null  float64
 18  total_amount           100000 non-null  float64
dtypes: float64(12), int64(4), object(3)
memory usage: 13.4+ MB

In [17]:
# data type conversion

df['tpep_pickup_datetime'] = pd.to_datetime(df['tpep_pickup_datetime'])
df['tpep_dropoff_datetime'] = pd.to_datetime(df['tpep_dropoff_datetime'])

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 19 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   VendorID               100000 non-null  int64
 1   tpep_pickup_datetime   100000 non-null  datetime64[ns]
 2   tpep_dropoff_datetime  100000 non-null  datetime64[ns]
 3   passenger_count        100000 non-null  int64
 4   trip_distance          100000 non-null  float64
 5   pickup_longitude       100000 non-null  float64
 6   pickup_latitude        100000 non-null  float64
 7   RatecodeID             100000 non-null  int64
 8   store_and_fwd_flag     100000 non-null  object
 9   dropoff_longitude      100000 non-null  float64
 10  dropoff_latitude       100000 non-null  float64
 11  payment_type           100000 non-null  int64
 12  fare_amount            100000 non-null  float64
 13  extra                  100000 non-null  float64
 14  mta_tax                100000 non-null  float64
 15  tip_amount             100000 non-null  float64
 16  tolls_amount           100000 non-null  float64
 17  improvement_surcharge  100000 non-null  float64
 18  total_amount           100000 non-null  float64
dtypes: datetime64[ns](2), float64(12), int64(4), object(1)
memory usage: 14.1+ MB

In [22]:
# creating dimseion table with date feilds, removing duplicates
dim_datetime = df[['tpep_pickup_datetime','tpep_dropoff_datetime']].drop_duplicates().reset_index(drop = True)

In [23]:
dim_datetime.head(2)

  tpep_pickup_datetime tpep_dropoff_datetime
0           2016-03-01   2016-03-01 00:07:55
1           2016-03-01   2016-03-01 00:11:06

In [32]:
# adding/ creating columns in dim date time table
dim_datetime['pick_hour'] = dim_datetime['tpep_pickup_datetime'].dt.hour
dim_datetime['pick_day'] = dim_datetime['tpep_pickup_datetime'].dt.day
dim_datetime['pick_month'] = dim_datetime['tpep_pickup_datetime'].dt.month
dim_datetime['pick_year'] = dim_datetime['tpep_pickup_datetime'].dt.year
dim_datetime['pick_weekday'] = dim_datetime['tpep_pickup_datetime'].dt.weekday
dim_datetime['drop_hour'] = dim_datetime['tpep_dropoff_datetime'].dt.hour
dim_datetime['drop_day'] = dim_datetime['tpep_dropoff_datetime'].dt.day
dim_datetime['drop_month'] = dim_datetime['tpep_dropoff_datetime'].dt.month
dim_datetime['drop_year'] = dim_datetime['tpep_dropoff_datetime'].dt.year
dim_datetime['drop_weekday'] = dim_datetime['tpep_dropoff_datetime'].dt.weekday.index

# creating id column using index
dim_datetime['datetime_id'] = dim_datetime.index

In [29]:
dim_datetime.head(2)

,tpep_pickup_datetime,tpep_dropoff_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,2016-03-01,2016-03-01 00:07:55,0,1,3,2016,1,0,1,3,2016,1
1,2016-03-01,2016-03-01 00:11:06,0,1,3,2016,1,0,1,3,2016,1

In [30]:
dim_datetime.shape

(99853, 12)

In [33]:
# Rearranging the fields in the dimsenion table
dim_datetime[['datetime_id','tpep_pickup_datetime','pick_hour','pick_day','pick_month','pick_year','pick_weekday','tpep_dropoff_datetime','drop_hour','drop_day','drop_month','drop_year','drop_weekday']]

,datetime_id,tpep_pickup_datetime,pick_hour,pick_day,pick_month,pick_year,pick_weekday,tpep_dropoff_datetime,drop_hour,drop_day,drop_month,drop_year,drop_weekday
0,0,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:07:55,0,1,3,2016,0
1,1,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:11:06,0,1,3,2016,1
2,2,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:31:06,0,1,3,2016,2
3,3,2016-03-01 00:00:00,0,1,3,2016,1,2016-03-01 00:00:00,0,1,3,2016,3
4,4,2016-03-01 00:00:01,0,1,3,2016,1,2016-03-01 00:16:04,0,1,3,2016,4
...,...,...,...,...,...,...,...,...,...,...,...,...,...
99848,99848,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:22:15,6,1,3,2016,99848
99849,99849,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:32:41,6,1,3,2016,99849
99850,99850,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:37:23,6,1,3,2016,99850
99851,99851,2016-03-01 06:17:10,6,1,3,2016,1,2016-03-01 06:22:09,6,1,3,2016,99851
99852,99852,2016-03-01 06:17:11,6,1,3,2016,1,2016-03-01 06:22:00,6,1,3,2016,99852

In [37]:
#Creating passenger count dimension table

# deleting duplicates and resetting the index
dim_passenger_count = df[['passenger_count']].drop_duplicates().reset_index(drop = True)
#creating id column using index
dim_passenger_count['passenger_count_id'] = dim_passenger_count.index
#rearranging the columns
dim_passenger_count = dim_passenger_count[['passenger_count_id','passenger_count']]

#sample data
dim_passenger_count.head(2)

   passenger_count_id  passenger_count
0                   0                1
1                   1                2

In [39]:
#Creating trip distance  dimension table

# deleting duplicates and resetting the index
dim_trip_distance = df[['trip_distance']].drop_duplicates().reset_index(drop= True)
#creating id column using index
dim_trip_distance['trip_distance_id'] = dim_trip_distance.index
#rearranging the columns
dim_trip_distance = dim_trip_distance[['trip_distance_id','trip_distance']]

#sample data
dim_trip_distance.head(2)

   trip_distance_id  trip_distance
0                 0            2.5
1                 1            2.9

In [41]:
#Creating rate code  dimension table

# creating dict to fetch the names or add values in name column
rate_code_type = {
    1 : "Standard Rate",
    2 : "JFK",
    3 : "Newark",
    4 : "Nassau or Westchester",
    5 : "Negotiated Fare",
    6 : "Group Ride",
}

# deleting duplicates and resetting the index
dim_rate_code = df[['RatecodeID']].drop_duplicates().reset_index(drop = True)

#creating id column using index
dim_rate_code['rate_code_id'] = dim_rate_code.index
# mapping dict
dim_rate_code['rate_code_name'] = dim_rate_code['RatecodeID'].map(rate_code_type)

#rearranging the columns
dim_rate_code = dim_rate_code[['rate_code_id','RatecodeID','rate_code_name']]

#sample data
dim_rate_code.head(2)

   rate_code_id  RatecodeID rate_code_name
0             0           1  Standard Rate
1             1           3         Newark

In [43]:
#Creating pickup location  dimension table

dim_pickup_location  = df[['pickup_longitude','pickup_latitude']].drop_duplicates().reset_index(drop = True)

#creating id column using index
dim_pickup_location['pickup_location_id'] = dim_pickup_location.index

#rearranging the columns
dim_pickup_location = dim_pickup_location[['pickup_location_id','pickup_latitude','pickup_longitude']]

#sample data
dim_pickup_location.head(2)

   pickup_location_id  pickup_latitude  pickup_longitude
0                   0        40.765152        -73.976746
1                   1        40.767925        -73.983482

In [44]:
#Creating Dropoff location  dimension table

dim_dropoff_location  = df[['dropoff_longitude','dropoff_latitude']].drop_duplicates().reset_index(drop = True)

#creating id column using index
dim_dropoff_location['dropoff_location_id'] = dim_dropoff_location.index

#rearranging the columns
dim_dropoff_location = dim_dropoff_location[['dropoff_location_id','dropoff_latitude','dropoff_longitude']]

#sample data
dim_dropoff_location.head(2)

   dropoff_location_id  dropoff_latitude  dropoff_longitude
0                    0         40.746128         -74.004265
1                    1         40.733166         -74.005943

In [45]:
#Creating payment type  dimension table

# creating dict to fetch the names or add values in name column
payment_type = {
    1 : "Credit Card",
    2 : "Cash",
    3 : "No Charge",
    4 : "Dispute",
    5 : "Unknown",
    6 : "Voided Trip",
}

# deleting duplicates and resetting the index
dim_payment_type = df[['payment_type']].drop_duplicates().reset_index(drop = True)

#creating id column using index
dim_payment_type['payment_type_id'] = dim_payment_type.index
# mapping dict
dim_payment_type['payment_type_name'] = dim_payment_type['payment_type'].map(payment_type)

#rearranging the columns
dim_payment_type = dim_payment_type[['payment_type_id','payment_type','payment_type_name']]

#sample data
dim_payment_type.head(2)

   payment_type_id  payment_type payment_type_name
0                0             1       Credit Card
1                1             2              Cash

In [50]:
# Fact table creation 

fact_uber = df.merge(dim_passenger_count, on = 'passenger_count')\
            .merge(dim_trip_distance, on = 'trip_distance')\
            .merge(dim_rate_code, on = 'RatecodeID')\
            .merge(dim_pickup_location, on = ['pickup_latitude','pickup_longitude'])\
            .merge(dim_dropoff_location, on = ['dropoff_latitude','dropoff_longitude'])\
            .merge(dim_datetime, on = ['tpep_pickup_datetime','tpep_dropoff_datetime'])\
            .merge(dim_payment_type, on = 'payment_type')\
            [['VendorID','datetime_id','passenger_count_id','trip_distance_id','rate_code_id',
              'store_and_fwd_flag','pickup_location_id','dropoff_location_id',
              'payment_type_id','fare_amount','extra','mta_tax','tip_amount','tolls_amount',
              'improvement_surcharge','total_amount']]

In [51]:
fact_uber.columns

Index(['VendorID', 'datetime_id', 'passenger_count_id', 'trip_distance_id',
       'rate_code_id', 'store_and_fwd_flag', 'pickup_location_id',
       'dropoff_location_id', 'payment_type_id', 'fare_amount', 'extra',
       'mta_tax', 'tip_amount', 'tolls_amount', 'improvement_surcharge',
       'total_amount'],
      dtype='object')

In [52]:
fact_uber.head(2)

,VendorID,datetime_id,passenger_count_id,trip_distance_id,rate_code_id,store_and_fwd_flag,pickup_location_id,dropoff_location_id,payment_type_id,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,0,0,0,0,N,0,0,0,9.0,0.5,0.5,2.05,0.0,0.3,12.35
1,2,1491,0,0,0,N,1481,1484,0,10.5,0.0,0.5,2.26,0.0,0.3,13.56